So, here's again the issue... 😢 
As expected, if it goes out magically, it will come again magically! 😅 

This random failures smells that it could be related to the time when it's executed.

This one was executed on Oct 29th at 11:40 from Spain (GMT+1) and was performed against European Artifactory SaaS instance.

```hcl
Terraform will perform the following actions:
  # xray_ignore_rule.vulnerabilities["my-rule"] will be created
  + resource "xray_ignore_rule" "vulnerabilities" {
      + author          = (known after apply)
      + created         = (known after apply)
      + cves            = [
          + "CVE-2018-20225",
        ]
      + expiration_date = "2024-11-25"
      + id              = (known after apply)
      + is_expired      = (known after apply)
      + notes           = "my-rule"
      + project_key     = "ni"
      + watches         = [
          + "ni-vulnerabilities",
        ]
      + artifact {
          + name = "docker://python"
        }
      + component {
          + name = "pypi://pip"
        }
    }
Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.
  Enter a value: 
xray_ignore_rule.vulnerabilities["my-rule"]: Creating...
╷
│ Error: Provider produced inconsistent result after apply
│ 
│ When applying changes to xray_ignore_rule.vulnerabilities["my-rule"],
│ provider "provider[\"registry.terraform.io/jfrog/xray\"]" produced an
│ unexpected new value: .expiration_date: was cty.StringVal("2024-11-25"),
│ but now cty.StringVal("2024-11-24").
│ 
│ This is a bug in the provider, which should be reported in the provider's
│ own issue tracker.
╵```

If I find another executions where it works, I'll post here all info...